//Задача №3
Console.Write("Введите число: ");
int N = int.Parse(Console.ReadLine());

if(N%2 == 0)
{
    Console.WriteLine(N + " - чётное число");
}

else
{
   Console.WriteLine(N + " - нечётное число!!!"); 
}


